{"class_name": "Model", "keras_version": "1.0.7", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 9.999999960041972e-12, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "output_dim": 600}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 9.999999960041972e-12, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "output_dim": 200}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_3"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]], "name": "model_1"}}